{
    "name": "Aghakhani2022 - Human breast cancer-associated fibroblast model",
    "format": {
        "name": "SBML",
        "identifier": "SBML",
        "version": "L3V1"
    },
    "publication": {
        "type": "DOI",
        "accession": "10.1101/2023.05.11.540378",
        "journal": "bioRxiv",
        "title": "Hybrid computational modeling highlights reverse Warburg effect in breast cancer-associated fibroblasts",
        "affiliation": "(1) GenHotel – European Research Laboratory for Rheumatoid Arthritis, Univ. Evry, Univ. Paris-Saclay, Evry, France & (2) Lifeware Group, Inria Saclay Île-de-France, Palaiseau, France.",
        "synopsis": "Cancer-associated fibroblasts (CAFs) are key players of the tumor microenvironment (TME) involved in cancer initiation, progression, and resistance to therapy. These cells exhibit aggressive phenotypes affecting, among others, extracellular matrix remodeling, angiogenesis, immune system modulation, tumor growth, and proliferation. CAFs phenotypic changes appear to be associated with metabolic alterations, notably a reverse Warburg effect that may drive fibroblasts transformation. However, its precise molecular mechanisms and regulatory drivers are still under investigation. Deciphering the reverse Warburg effect in breast CAFs may contribute to a better understanding of the interplay between TME and tumor cells, leading to new treatment strategies. In this regard, dynamic modeling approaches able to span multiple biological layers are essential to capture the emergent properties of various biological entities when complex and intertwined pathways are involved. This work presents the first hybrid large-scale computational model for breast CAFs covering major cellular signaling, gene regulation, and metabolic processes. It was generated by combining an asynchronous cell- and disease-specific regulatory Boolean model with a generic core metabolic network leveraging both data-driven and manual curation approaches. This model reproduces the experimentally observed reverse Warburg effect in breast CAFs and further identifies Hypoxia-Inducible Factor 1 (HIF-1) as its key molecular driver. Targeting HIF-1 as part of a TME-centered therapeutic strategy may prove beneficial in the treatment of breast cancer by addressing the reverse Warburg effect. Such findings in CAFs, considering our previously published results in rheumatoid arthritis synovial fibroblasts, point to a common HIF-1-driven metabolic reprogramming of fibroblasts in breast cancer and rheumatoid arthritis.\n\nAll analyses are compiled and thoroughly annotated in Jupyter notebooks and R scripts available on a GitLab repository (https://gitlab.com/genhotel/breast-cafs-reverse-warburg-effect) and a Zenodo permanent archive.",
        "year": 2023,
        "month": "5",
        "link": "http://identifiers.org/doi/10.1101/2023.05.11.540378",
        "authors": [
            {
                "name": "Sahar Aghakhani"
            },
            {
                "name": "Sacha E Silva-Saffar"
            },
            {
                "name": "Sylvain Soliman"
            },
            {
                "name": "Anna Niarakis"
            }
        ]
    },
    "files": {
        "main": [
            {
                "name": "CAF-Model.xml",
                "description": "SBML L3V1 large-scale Boolean model of human breast cancer-associated-fibroblasts",
                "fileSize": "1506958",
                "mimeType": "application/xml",
                "md5sum": "1fb2d0296db5d5609bd078de63e75a17",
                "sha1sum": "905ec7f108b889d753154d99d1db3de7a855cd88",
                "sha256sum": "42c966a9832295b8faf3b6d0dfa108368362088de5b9229c3259f10eba7c98d8"
            }
        ]
    },
    "history": {
        "revisions": [
            {
                "version": 1,
                "submitted": 1688889075,
                "submitter": "Sahar Aghakhani",
                "comment": "Import of Aghakhani2022 - Human breast cancer-associated fibroblast model"
            }
        ]
    },
    "firstPublished": 1688906346,
    "submissionId": "MODEL2307090001",
    "modellingApproach": {
        "accession": "MAMO_0000053",
        "name": "boolean model",
        "resource": "http://identifiers.org/mamo/MAMO_0000053"
    },
    "curationStatus": "NON_CURATED",
    "modelTags": [
        "Not Peer Reviewed"
    ],
    "contributors": {
        "Modeller": [
            {
                "name": "Sahar Aghakhani",
                "email": "sahar.aghakhani@aixial.com",
                "affiliation": "Université Paris-Saclay",
                "orcid": "0000-0002-6392-4687",
                "external": false
            }
        ]
    },
    "vcsIdentifier": "aaj",
    "modelLevelAnnotations": [
        {
            "qualifier": "bqmodel:isDescribedBy",
            "accession": "10.1101/2023.05.11.540378",
            "resource": "DOI",
            "uri": "http://identifiers.org/doi:10.1101/2023.05.11.540378"
        },
        {
            "qualifier": "bqbiol:hasProperty",
            "accession": "MAMO:0000053",
            "name": "boolean model",
            "resource": "Mathematical Modelling Ontology",
            "uri": "http://identifiers.org/mamo/MAMO_0000053"
        }
    ]
}