{
    "BIOMD0000000919": {
        "name": "Ledzewicz2013 - On optimal chemotherapy with a strongly targeted agent for a model of tumor immune system interactions with generalized logistic growth",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>On optimal chemotherapy with a strongly targeted agent for a model of tumor-immune system interactions with generalized logistic growth.Ledzewicz U1, Olumoye O, Schättler H.1Dept. of Mathematics and Statistics, Southern Illinois University Edwardsville, Edwardsville, Illinois 62026-1653, USA. uledzew@siue.eduAbstractIn this paper, a mathematical model for chemotherapy that takes tumor immune-system interactions into account is considered for a strongly targeted agent. We use a classical model originally formulated by Stepanova, but replace exponential tumor growth with a generalised logistic growth model function depending on a parameter v. This growth function interpolates between a Gompertzian model (in the limit v → 0) and an exponential model (in the limit v → ∞). The dynamics is multi-stable and equilibria and their stability will be investigated depending on the parameter v. Except for small values of v, the system has both an asymptotically stable microscopic (benign) equilibrium point and an asymptotically stable macroscopic (malignant) equilibrium point. The corresponding regions of attraction are separated by the stable manifold of a saddle. The optimal control problem of moving an initial condition that lies in the malignant region into the benign region is formulated and the structure of optimal singular controls is determined</pre>      </body>    </notes>"
    },
    "BIOMD0000000921": {
        "name": "Khajanchi2017 - Uniform Persistence and Global Stability for a Brain Tumor and Immune System Interaction",
        "description": "This paper describes the synergistic interaction between the growth of malignant gliomas and the immune system interactions using a system of coupled ordinary di®erential equations (ODEs). The proposed mathematical model comprises the interaction of glioma cells, macrophages, activated Cytotoxic T-Lymphocytes (CTLs), the immunosuppressive factor TGF- and the immuno-stimulatory factor IFN-. The dynamical behavior of the proposed system both analytically and numerically is investigated from the point of view of stability. By constructing Lyapunov functions, the global behavior of the glioma-free and the interior equilibrium point have been analyzed under some assumptions. Finally, we perform numerical simulations in order to illustrate our analytical ¯ndings by varying the system parameters."
    },
    "BIOMD0000001013": {
        "name": "Leon-Triana2021 - Competition between tumour cells and single-target CAR T-cells",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>This model of the use of chimeric antigen receptor (CAR)-T cell therapy in the treatment of solid tumours is described in the article:\"Dual-Target CAR-Ts with On- and Off-Tumour Activity May Override Immune Suppression in Solid Cancers: A Mathematical Proof of Concept\"Odelaisy León-Triana, Antonio Pérez-Martínez, Manuel Ramírez-Orellana and Víctor M. Pérez-GarcíaCancers 2021, 13, 703.; doi: 10.3390/cancers13040703Comment:This is the first mathematical model, derived from equations 1 and 2, used in the paper.Reproduction of Fig. 5a was achieved by setting alpha_1 = 0.04, different to the value quoted in the article caption for Fig. 5.Abstract:Chimeric antigen receptor (CAR)-T cell-based therapies have achieved substantial success against B-cell malignancies, which has led to a growing scientific and clinical interest in extending their use to solid cancers. However, results for solid tumours have been limited up to now, in part due to the immunosuppressive tumour microenvironment, which is able to inactivate CAR-T cell clones. In this paper we put forward a mathematical model describing the competition of CAR-T and tumour cells, taking into account their immunosuppressive capacity. Using the mathematical model, we show that the use of large numbers of CAR-T cells targetting the solid tumour antigens could overcome the immunosuppressive potential of cancer. To achieve such high levels of CAR-T cells we propose, and study computationally, the manufacture and injection of CAR-T cells targetting two antigens: CD19 and a tumour-associated antigen. We study in silico the resulting dynamics of the disease after the injection of this product and find that the expansion of the CAR-T cell population in the blood and lymphopoietic organs could lead to the massive production of an army of CAR-T cells targetting the solid tumour, and potentially overcoming its immune suppression capabilities. This strategy could benefit from the combination with PD-1 inhibitors and low tumour loads. Our computational results provide theoretical support for the treatment of different types of solid tumours using T cells engineered with combination treatments of dual CARs with on- and off-tumour activity and anti-PD-1 drugs after completion of classical cytoreductive treatments.</pre>      </body>    </notes>"
    },
    "BIOMD0000001014": {
        "name": "Leon-Triana2021 - Competition between tumour cells and dual-target CAR T-cells",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>This model of the use of chimeric antigen receptor (CAR)-T cell therapy in the treatment of solid tumours is described in the article:\"Dual-Target CAR-Ts with On- and Off-Tumour Activity May Override Immune Suppression in Solid Cancers: A Mathematical Proof of Concept\"Odelaisy León-Triana, Antonio Pérez-Martínez, Manuel Ramírez-Orellana and Víctor M. Pérez-GarcíaCancers 2021, 13, 703.; doi: 10.3390/cancers13040703Comment:This is the second mathematical model, derived from equations 3 to 6, used in the paper.Reproduction of Figure 5b was achieved by setting alpha_1 = 0.183, in substitution for alpha_1 = 0.2 as quoted in the article.Abstract:Chimeric antigen receptor (CAR)-T cell-based therapies have achieved substantial success against B-cell malignancies, which has led to a growing scientific and clinical interest in extending their use to solid cancers. However, results for solid tumours have been limited up to now, in part due to the immunosuppressive tumour microenvironment, which is able to inactivate CAR-T cell clones. In this paper we put forward a mathematical model describing the competition of CAR-T and tumour cells, taking into account their immunosuppressive capacity. Using the mathematical model, we show that the use of large numbers of CAR-T cells targetting the solid tumour antigens could overcome the immunosuppressive potential of cancer. To achieve such high levels of CAR-T cells we propose, and study computationally, the manufacture and injection of CAR-T cells targetting two antigens: CD19 and a tumour-associated antigen. We study in silico the resulting dynamics of the disease after the injection of this product and find that the expansion of the CAR-T cell population in the blood and lymphopoietic organs could lead to the massive production of an army of CAR-T cells targetting the solid tumour, and potentially overcoming its immune suppression capabilities. This strategy could benefit from the combination with PD-1 inhibitors and low tumour loads. Our computational results provide theoretical support for the treatment of different types of solid tumours using T cells engineered with combination treatments of dual CARs with on- and off-tumour activity and anti-PD-1 drugs after completion of classical cytoreductive treatments.</pre>      </body>    </notes>"
    },
    "BIOMD0000001022": {
        "name": "Creemers2021 - Tumor-immune dynamics and implications on immunotherapy responses",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>This ordinary differential equation model simulating the mechanisms that govern cancer-immune dynamics and their role in tumor responses to immunotherapy is described by the publication:Creemers JHA, Lesterhuis WJ, Mehra N, et al.\"A tipping point in cancer-immune dynamics leads to divergent immunotherapy responses and hampers biomarker discovery.\"Journal for ImmunoTherapy of Cancer 2021;9:e002032.doi:10.1136/jitc-2020-002032Comment:Simulation parameters in supplementary table 1 mismatch with figure 1 in manuscript. Therefore, to clarify, the following parameter values were used:Reproduction of Fig. 1(C), xi = 0.0005Reproduction of Fig. 1(D), xi = 0.00025Abstract:Background: Predicting treatment response or survival of cancer patients remains challenging in immuno-oncology. Efforts to overcome these challenges focus, among others, on the discovery of new biomarkers. Despite advances in cellular and molecular approaches, only a limited number of candidate biomarkers eventually enter clinical practice.Methods: A computational modeling approach based on ordinary differential equations was used to simulate the fundamental mechanisms that dictate tumor-immune dynamics and to investigate its implications on responses to immune checkpoint inhibition (ICI) and patient survival. Using in silico biomarker discovery trials, we revealed fundamental principles that explain the diverging success rates of biomarker discovery programs.Results: Our model shows that a tipping point—a sharp state transition between immune control and immune evasion—induces a strongly non-linear relationship between patient survival and both immunological and tumor-related parameters. In patients close to the tipping point, ICI therapy may lead to long-lasting survival benefits, whereas patients far from the tipping point may fail to benefit from these potent treatments.Conclusion: These findings have two important implications for clinical oncology. First, the apparent conundrum that ICI induces substantial benefits in some patients yet completely fails in others could be, to a large extent, explained by the presence of a tipping point. Second, predictive biomarkers for immunotherapy should ideally combine both immunological and tumor-related markers, as a patient’s distance from the tipping point can typically not be reliably determined from solely one of these. The notion of a tipping point in cancer-immune dynamics helps to devise more accurate strategies to select appropriate treatments for patients with cancer.</pre>      </body>    </notes>"
    },
    "BIOMD0000001023": {
        "name": "Alharbi2020 - An ODE-based model of the dynamics of tumor cell progression and its effects on normal cell growth and immune system functionality",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>This ordinary differential equation model of tumor cell growth, called the normal-tumor-immune-unhealthy diet model (NTIUNHDM), is described by the publication:Alharbi, S.A.; Rambely, A.S.\"A New ODE-Based Model for Tumor Cells and Immune System Competition\"Mathematics 2020, 8, 1285.doi:10.3390/math8081285Abstract:Changes in diet are heavily associated with high mortality rates in several types of cancer. In this paper, a new mathematical model of tumor cells growth is established to dynamically demonstrate the effects of abnormal cell progression on the cells affected by the tumor in terms of the immune system’s functionality and normal cells’ dynamic growth. This model is called the normal-tumor-immune-unhealthy diet model (NTIUNHDM) and governed by a system of ordinary differential equations. In the NTIUNHDM, there are three main populations normal cells, tumor cell and immune cells. The model is discussed analytically and numerically by utilizing a fourth-order Runge–Kutta method. The dynamic behavior of the NTIUNHDM is discussed by analyzing the stability of the system at various equilibrium points and the Mathematica software is used to simulate the model. From analysis and simulation of the NTIUNHDM, it can be deduced that instability of the response stage, due to a weak immune system, is classified as one of the main reasons for the coexistence of abnormal cells and normal cells. Additionally, it is obvious that the NTIUNHDM has only one stable case when abnormal cells begin progressing into early stages of tumor cells such that the immune cells are generated once. Thus, early boosting of the immune system might contribute to reducing the risk of cancer.</pre>      </body>    </notes>"
    },
    "BIOMD0000001024": {
        "name": "Chaudhury2020 - Lotka-Volterra mathematical model of CAR-T cell and tumour kinetics",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>This ordinary differential equation model of the cellular kinetics and pharmacodynamics of CAR-T cell therapy is described in the publication:Chaudhury, A., Zhu, X., Chu, L., Goliaei, A., June, C., Kearns, J. and Stein, A., 2020. Chimeric Antigen Receptor T Cell Therapies: A Review of Cellular Kinetic‐Pharmacodynamic Modeling Approaches. The Journal of Clinical Pharmacology, 60(S1).DOI: 10.1002/jcph.1691Comment:This model is based on equations 4-5 from the manuscript.Abstract:Chimeric antigen receptor T cell (CAR-T cell) therapies have shown significant efficacy in CD19+ leukemias and lymphomas. There remain many challenges and questions for improving next-generation CAR-T cell therapies, and mathematical modeling of CAR-T cells may play a role in supporting further development. In this review, we introduce a mathematical modeling taxonomy for a set of relatively simple cellular kinetic-pharmacodynamic models that describe the in vivo dynamics of CAR-T cell and their interactions with cancer cells. We then discuss potential extensions of this model to include target binding, tumor distribution, cytokine-release syndrome, immunophenotype differentiation, and genotypic heterogeneity.</pre>      </body>    </notes>"
    },
    "BIOMD0000001025": {
        "name": "Chaudhury2020 - EC50 expansion and killing mathematical model of CAR-T cell and tumour kinetics",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>This ordinary differential equation model of the cellular kinetics and pharmacodynamics of CAR-T cell therapy is described in the publication:Chaudhury, A., Zhu, X., Chu, L., Goliaei, A., June, C., Kearns, J. and Stein, A., 2020. Chimeric Antigen Receptor T Cell Therapies: A Review of Cellular Kinetic‐Pharmacodynamic Modeling Approaches. The Journal of Clinical Pharmacology, 60(S1).DOI: 10.1002/jcph.1691Comment:This model is based on equations 7-9 from the manuscript.Abstract:Chimeric antigen receptor T cell (CAR-T cell) therapies have shown significant efficacy in CD19+ leukemias and lymphomas. There remain many challenges and questions for improving next-generation CAR-T cell therapies, and mathematical modeling of CAR-T cells may play a role in supporting further development. In this review, we introduce a mathematical modeling taxonomy for a set of relatively simple cellular kinetic-pharmacodynamic models that describe the in vivo dynamics of CAR-T cell and their interactions with cancer cells. We then discuss potential extensions of this model to include target binding, tumor distribution, cytokine-release syndrome, immunophenotype differentiation, and genotypic heterogeneity.</pre>      </body>    </notes>"
    },
    "BIOMD0000001031": {
        "name": "Al-Tuwairqi2020 - Dynamics of cancer virotherapy - Phase I treatment",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>This ordinary differential equation model of cancer virotherapy dynamics is described in the publication:Salma M. Al-Tuwairqi, Najwa O. Al-Johani, Eman A. Simbawa,\"Modeling dynamics of cancer radiovirotherapy\",Journal of Theoretical Biology, Volume 506, 2020, 110405, ISSN 0022-5193,DOI: 10.1016/j.jtbi.2020.110405.Comment:This model is represented by the equations in system (2) of the publication manuscript and describes the cancer-virus interactions for the Phase I virotherapy treatment.Abstract:Advances in genetic engineering have paved the way for a new therapy for cancer, which is called virotherapy. This treatment uses genetically engineered viruses which selectively infect, replicate in, and destroy cancer cells without damaging normal cells. Furthermore, current research and clinical trials have indicated that these viruses can be delivered as single agents or in combination with other therapies. In this paper, we propose systems of ordinary differential equations for modeling the dynamics of aggressive tumor growth under radiovirotherapy treatment. We divide the treatment period into two phases; consequently, we present two mathematical models. First, we formulate the virotherapy model as Phase I of the treatment. Then we extend the model to include radiotherapy in combination with virotherapy as Phase II of the treatment. Comprehensive qualitative analyses of both models are conducted. Furthermore, numerical experiments are performed in order to support the analytical results. An analysis of the parameters is also carried out to investigate their effects on the outcome of the treatment. Overall, the analytical results reveal that radiovirotherapy is more effective than, and a good alternative to, virotherapy, as it is capable of eradicating tumors completely.</pre>      </body>    </notes>"
    },
    "BIOMD0000001033": {
        "name": "Almuallem2020 - Virus-macrophage-tumour interactions in oncolytic viral therapies",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>This mathematical model of the role of the innate immune responses generated by macrophages in the context of anti-tumour oncolytic viral therapies is described in the publication:Nada Almuallem, Dumitru Trucu, Raluca Eftimie. \"Oncolytic viral therapies and the delicate balance between virus-macrophage-tumour interactions: A mathematical approach\". Mathematical Biosciences and Engineering, 2021, 18(1): 764-799.doi: 10.3934/mbe.2021041Comment:This model is represented by Equations 2.1a-f of the publication manuscript.Abstract:The success of oncolytic virotherapies depends on the tumour microenvironment, which contains a large number of infiltrating immune cells. In this theoretical study, we derive an ODE model to investigate the interactions between breast cancer tumour cells, an oncolytic virus (Vesicular Stomatitis Virus), and tumour-infiltrating macrophages with different phenotypes which can impact the dynamics of oncolytic viruses. The complexity of the model requires a combined analytical-numerical approach to understand the transient and asymptotic dynamics of this model. We use this model to propose new biological hypotheses regarding the impact on tumour elimination/relapse/persistence of: (i) different macrophage polarisation/re-polarisation rates; (ii) different infection rates of macrophages and tumour cells with the oncolytic virus; (iii) different viral burst sizes for macrophages and tumour cells. We show that increasing the rate at which the oncolytic virus infects the tumour cells can delay tumour relapse and even eliminate tumour. Increasing the rate at which the oncolytic virus particles infect the macrophages can trigger transitions between steady-state dynamics and oscillatory dynamics, but it does not lead to tumour elimination unless the tumour infection rate is also very large. Moreover, we confirm numerically that a large tumour-induced M1→M2 polarisation leads to fast tumour growth and fast relapse (if the tumour was reduced before by a strong anti-tumour immune and viral response). The increase in viral-induced M2→M1 re-polarisation reduces temporarily the tumour size, but does not lead to tumour elimination. Finally, we show numerically that the tumour size is more sensitive to the production of viruses by the infected macrophages.</pre>      </body>    </notes>"
    },
    "BIOMD0000001034": {
        "name": "Bunimovich-Mendrazitsky2007 - Mathematical model of BCG immunotherapy",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>This ordinary differential equation model, simulating the tumor-immune interactions involved in BCG immunotherapy to treat superficial bladder cancer, is described by the publication:Bunimovich-Mendrazitsky, S., Shochat, E., Stone, L. \"Mathematical Model of BCG Immunotherapy in Superficial Bladder Cancer\". Bull. Math. Biol. 69, 1847–1870 (2007). DOI: 10.1007/s11538-007-9195-zComment:This model is based on the system of ODEs given in Equation 4 of the publication manuscript.Reproduction of Figure 4 was achieved by setting p4 = 0.085.Abstract:Immunotherapy with Bacillus Calmette-Guérin (BCG)-an attenuated strain of Mycobacterium bovis (M. bovis) used for anti tuberculosis immunization-is a clinically established procedure for the treatment of superficial bladder cancer. However, the mode of action has not yet been fully elucidated, despite much extensive biological experience. The purpose of this paper is to develop a first mathematical model that describes tumor-immune interactions in the bladder as a result of BCG therapy. A mathematical analysis of the ODE model identifies multiple equilibrium points, their stability properties, and bifurcation points. Intriguing regimes of bistability are identified in which treatment has potential to result in a tumor-free equilibrium or a full-blown tumor depending only on initial conditions. Attention is given to estimating parameters and validating the model using published data taken from in vitro, mouse and human studies. The model makes clear that intensity of immunotherapy must be kept in limited bounds. While small treatment levels may fail to clear the tumor, a treatment that is too large can lead to an over-stimulated immune system having dangerous side effects for the patient.</pre>      </body>    </notes>"
    },
    "BIOMD0000001035": {
        "name": "Al-Tuwairqi2020 - Dynamics of cancer virotherapy with immune response",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>This ordinary differential equation model of the role of the immune response in cancer virotherapy dynamics is described in the publication:Al-Tuwairqi, S.M., Al-Johani, N.O.,  Simbawa, E.A. \"Modeling dynamics of cancer virotherapy with immune response.\" Adv Differ Equ 2020, 438 (2020).DOI: 10.1186/s13662-020-02893-6Comment:This model is represented by the system described in Equation 2 of the publication manuscript.Abstract:Virotherapy is a therapeutic treatment for cancer. It uses genetically engineered viruses to selectively infect, replicate in, and destroy cancer cells without damaging normal cells. In this paper, we present a modified model to include, within the dynamics of virotherapy, the interaction between uninfected tumor cells and immune response. The model is analyzed qualitatively to produce five equilibrium points. One of these equilibriums demonstrates the effect observed in virotherapy, where the immune system demolishes infected cells as well as viruses. Moreover, the existence and stability of the equilibrium points are established under certain criteria. Numerical simulations are performed to display the agreement with the analytical results. Finally, parameter analysis is carried out to illustrate which parameters in the model affect the outcome of virotherapy.</pre>      </body>    </notes>"
    },
    "BIOMD0000001036": {
        "name": "Cappuccio2007 - Tumor-immune system interactions and determination of the optimal therapeutic protocol in immunotherapy",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>This ordinary differential equation model is the Panetta-Kirschner model of tumor-immune interactions is described in the publication:Cappuccio A, Castiglione F, Piccoli B.\" Determination of the optimal therapeutic protocols in cancer immunotherapy.\" Math Biosci. 2007 Sep;209(1):1-13.doi: 10.1016/j.mbs.2007.02.009. Comment:The model represented in Equations 1-3 is the Panetta-Kirschner model and was used to reproduce Fig. 1.N.B.: Labelling of Fig. 1 graphs in manuscript mismatches with simulation results - CTL and tumor cell plots swapped.Abstract:Cancer immunotherapy aims at eliciting an immune system response against the tumor. However, it is often characterized by toxic side-effects. Limiting the tumor growth and, concurrently, avoiding the toxicity of a drug, is the problem of protocol design. We formulate this question as an optimization problem and derive an algorithm for its solution. Unlike the standard optimal control approach, the algorithm simulates impulse-like drug administrations. It relies on an exact computation of the gradient of the cost function with respect to any protocol by means of the variational equations, that can be solved in parallel with the system. In comparison with previous versions of this method [F. Castiglione, B. Piccoli, Optimal control in a model of dendritic cell transfection cancer immunotherapy, Bull. Math. Biol. 68 (2006) 255-274; B. Piccoli, F. Castiglione, Optimal vaccine scheduling in cancer immunotherapy, Physica A. 370 (2) (2007) 672-680], we optimize both the timing and the dosage of each administration and introduce a penalty term to avoid clustering of subsequent injections, a requirement consistent with the clinical practice. In addition, we implement the optimization scheme to simulate the case of multi-therapies. The procedure works for any ODE system describing the pharmacokinetics and pharmacodynamics of an arbitrary number of therapeutic agents. In this work, it was tested for a well known model of the tumor-immune system interaction [D. Kirschner, J.C. Panetta, Modeling immunotherapy of tumor-immune interaction, J. Math. Biol. 37 (1998) 235-252]. Exploring three immunotherapeutic scenarios (CTL therapy, IL-2 therapy and combined therapy), we display the stability and efficacy of the optimization method, obtaining protocols that are successful compromises between various clinical requirements.</pre>      </body>    </notes>"
    },
    "BIOMD0000001041": {
        "name": "Kimmel2021 - T cell competition and stochastic extinction events in CAR T cell therapy",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>This mathematical model of T cell-tumour interactions considering the roles of T cell competition and stochastic extinction events in CAR T cell therapy is described by the publication:Kimmel GJ, Locke FL, Altrock PM. \"The roles of T cell competition and stochastic extinction events in chimeric antigen receptor T cell therapy.\" Proc Biol Sci. 2021 Mar 31;288(1947):20210229.doi: 10.1098/rspb.2021.0229Comment:Reproduction of Fig. 2(a) and (b) was simulated by using the fitted model parameter set given in Table 1 of the manuscript's Supplementary Material, however substituting the values of r_N and rho_C for those stated in Table 1 of the publication manuscript, i.e. r_N = 0.17 and rho_C = 0.0251.Abstract:Chimeric antigen receptor (CAR) T cell therapy is a remarkably effective immunotherapy that relies on in vivo expansion of engineered CAR T cells, after lymphodepletion (LD) by chemotherapy. The quantitative laws underlying this expansion and subsequent tumour eradication remain unknown. We develop a mathematical model of T cell–tumour cell interactions and demonstrate that expansion can be explained by immune reconstitution dynamics after LD and competition among T cells. CAR T cells rapidly grow and engage tumour cells but experience an emerging growth rate disadvantage compared to normal T cells. Since tumour eradication is deterministically unstable in our model, we define cure as a stochastic event, which, even when likely, can occur at variable times. However, we show that variability in timing is largely determined by patient variability. While cure events impacted by these fluctuations occur early and are narrowly distributed, progression events occur late and are more widely distributed in time. We parameterized our model using population-level CAR T cell and tumour data over time and compare our predictions with progression-free survival rates. We find that therapy could be improved by optimizing the tumour-killing rate and the CAR T cells' ability to adapt, as quantified by their carrying capacity. Our tumour extinction model can be leveraged to examine why therapy works in some patients but not others, and to better understand the interplay of deterministic and stochastic effects on outcomes. For example, our model implies that LD before a second CAR T injection is necessary.</pre>      </body>    </notes>"
    },
    "BIOMD0000001042": {
        "name": "Makhlouf2020 - No treatment model of the role of CD4 T cells in tumor-immune interactions",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>This ordinary differential equation model simulating the interactions between tumor and immune cells is detailed in the publication:Ahmed M. Makhlouf, Lamiaa El-Shennawy, Hesham A. Elkaranshawy, \"Mathematical Modelling for the Role of CD4+T Cells in Tumor-Immune Interactions\", Comput Math Methods Med. 2020 Feb 19;2020:7187602.doi: 10.1155/2020/7187602Comment:This no treatment model is described by equations 1-7 of the publication manuscript. Abstract:Mathematical modelling has been used to study tumor-immune cell interaction. Some models were proposed to examine the effect of circulating lymphocytes, natural killer cells, and CD8+T cells, but they neglected the role of CD4+T cells. Other models were constructed to study the role of CD4+T cells but did not consider the role of other immune cells. In this study, we propose a mathematical model, in the form of a system of nonlinear ordinary differential equations, that predicts the interaction between tumor cells and natural killer cells, CD4+T cells, CD8+T cells, and circulating lymphocytes with or without immunotherapy and/or chemotherapy. This system is stiff, and the Runge–Kutta method failed to solve it. Consequently, the “Adams predictor-corrector” method is used. The results reveal that the patient’s immune system can overcome small tumors; however, if the tumor is large, adoptive therapy with CD4+T cells can be an alternative to both CD8+T cell therapy and cytokines in some cases. Moreover, CD4+T cell therapy could replace chemotherapy depending upon tumor size. Even if a combination of chemotherapy and immunotherapy is necessary, using CD4+T cell therapy can better reduce the dose of the associated chemotherapy compared to using combined CD8+T cells and cytokine therapy. Stability analysis is performed for the studied patients. It has been found that all equilibrium points are unstable, and a condition for preventing tumor recurrence after treatment has been deduced. Finally, a bifurcation analysis is performed to study the effect of varying system parameters on the stability, and bifurcation points are specified. New equilibrium points are created or demolished at some bifurcation points, and stability is changed at some others. Hence, for systems turning to be stable, tumors can be eradicated without the possibility of recurrence. The proposed mathematical model provides a valuable tool for designing patients’ treatment intervention strategies.</pre>      </body>    </notes>"
    },
    "BIOMD0000000743": {
        "name": "Gallaher2018 - Tumor–Immune dynamics in multiple myeloma",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">     <p>The paper describes a model on the key components for tumor–immune dynamics in multiple myeloma.Created by COPASI 4.25 (Build 207)This model is described in the article:Methods for determining key components in a mathematical model for tumor–immune dynamics in multiple myelomaJill Gallaher, Kamila Larripa, Marissa Renardy, Blerta Shtylla, Nessy Tania, Diana White, Karen Wood, Li Zhu, Chaitali Passey, Michael Robbins, Natalie Bezman, Suresh Shelat, Hearn Jay Choo, Helen MooreJournal of Theoretical Biology 458 (2018) 31–46Abstract:In this work, we analyze a mathematical model we introduced previously for the dynamics of multiple myeloma and the immune system. We focus on four main aspects: (1) obtaining and justifying ranges and values for all parameters in the model; (2) determining a subset of parameters to which the model is most sensitive; (3) determining which parameters in this subset can be uniquely estimated given cer- tain types of data; and (4) exploring the model numerically. Using global sensitivity analysis techniques, we found that the model is most sensitive to certain growth, loss, and efficacy parameters. This anal- ysis provides the foundation for a future application of the model: prediction of optimal combination regimens in patients with multiple myeloma.This model is hosted on BioModels Database and identified by: MODEL1907050001To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models .To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information.</p>  </body>    </notes>"
    },
    "BIOMD0000000741": {
        "name": "Eftimie2018 - Cancer and Immune biomarkers",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>The paper describes a model on the detection of cancer based on cancer and immune biomarkers. Created by COPASI 4.25 (Build 207) This model is described in the article: Improving cancer detection through combinations of cancer and immune biomarkers: a modelling approach Raluca Eftimie and and Esraa Hassanein J Transl Med (2018) 16:73 Abstract: Background: Early cancer diagnosis is one of the most important challenges of cancer research, since in many can- cers it can lead to cure for patients with early stage diseases. For epithelial ovarian cancer (which is the leading cause of death among gynaecologic malignancies) the classical detection approach is based on measurements of CA-125 biomarker. However, the poor sensitivity and specificity of this biomarker impacts the detection of early-stage cancers. Methods: Here we use a computational approach to investigate the effect of combining multiple biomarkers for ovarian cancer (e.g., CA-125 and IL-7), to improve early cancer detection. Results: We show that this combined biomarkers approach could lead indeed to earlier cancer detection. However, the immune response (which influences the level of secreted IL-7 biomarker) plays an important role in improving and/or delaying cancer detection. Moreover, the detection level of IL-7 immune biomarker could be in a range that would not allow to distinguish between a healthy state and a cancerous state. In this case, the construction of solu- tion diagrams in the space generated by the IL-7 and CA-125 biomarkers could allow us predict the long-term evolu- tion of cancer biomarkers, thus allowing us to make predictions on cancer detection times. Conclusions: Combining cancer and immune biomarkers could improve cancer detection times, and any predic- tions that could be made (at least through the use of CA-125/IL-7 biomarkers) are patient specific. Keywords: Ovarian cancer, Mathematical model, CA-125 biomarker, IL-7 biomarker, Cancer detection times This model is hosted on BioModels Database and identified by: MODEL1907050002. To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models. To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information.</pre>      </body>    </notes>"
    },
    "BIOMD0000000744": {
        "name": "Hu2019 - Pancreatic cancer dynamics",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>The paper describes a model on the size of pancreatic tumour. Created by COPASI 4.25 (Build 207) This model is described in the article: Modeling Pancreatic Cancer Dynamics with Immunotherapy Xiaochuan Hu, Guoyi Ke and Sophia R.-J. Jang Bulletin of Mathematical Biology (2019) 81:1885–1915 Abstract: We develop a mathematical model of pancreatic cancer that includes pancreatic cancer cells, pancreatic stellate cells, effector cells and tumor-promoting and tumor- suppressing cytokines to investigate the effects of immunotherapies on patient survival. The model is first validated using the survival data of two clinical trials. Local sen- sitivity analysis of the parameters indicates there exists a critical activation rate of pro-tumor cytokines beyond which the cancer can be eradicated if four adoptive trans- fers of immune cells are applied. Optimal control theory is explored as a potential tool for searching the best adoptive cellular immunotherapies. Combined immunother- apies between adoptive ex vivo expanded immune cells and TGF-β inhibition by siRNA treatments are investigated. This study concludes that mono-immunotherapy is unlikely to control the pancreatic cancer and combined immunotherapies between anti-TGF-β and adoptive transfers of immune cells can prolong patient survival. We show through numerical explorations that how these two types of immunotherapies are scheduled is important to survival. Applying TGF-β inhibition first followed by adoptive immune cell transfers can yield better survival outcomes. This model is hosted on BioModels Database and identified by: MODEL1907050003. To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information.</pre>      </body>    </notes>"
    },
    "BIOMD0000000746": {
        "name": "Saad2017 - immune checkpoint and BCG in superficial bladder cancer",
        "description": "The paper describes a model on the Dynamics of Immune Checkpoints, Immune System, and BCG in the Treatment of Superficial Bladder Cancer. Created by COPASI 4.25 (Build 207) This model is described in the article: Dynamics of Immune Checkpoints, Immune System, and BCG in the Treatment of Superficial Bladder CancerFarouk Tijjani Saad, Evren Hincal, and Bilgen KaymakamzadeComputational and Mathematical Methods in Medicine, vol. 2017, no. 3573082Abstract: This paper aims to study the dynamics of immune suppressors/checkpoints, immune system, and BCG in the treatment of superficial bladder cancer. Programmed cell death protein-1 (PD-1), cytotoxic T-lymphocyte-associated antigen 4 (CTLA4), and transforming growth factor-beta (TGF-b) are some of the examples of immune suppressors/checkpoints. They are responsible for deactivating the immune system and enhancing immunological tolerance. Moreover, they categorically downregulate and suppress the immune system by preventing and blocking the activation of T-cells, which in turn decreases autoimmunity and enhances self- tolerance. In cancer immunotherapy, the immune checkpoints/suppressors prevent and block the immune cells from attacking, spreading, and killing the cancer cells, which leads to cancer growth and development. We formulate a mathematical model that studies three possible dynamics of the treatment and establish the effects of the immune checkpoints on the immune system and the treatment at large. Although the effect cannot be seen explicitly in the analysis of the model, we show it by numerical simulations.This model is hosted on BioModels Database and identified by: MODEL1907100001.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models. To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000748": {
        "name": "Phan2017 - innate immune in oncolytic virotherapy",
        "description": "The paper describes a model on the key components for tumor–immune dynamics in multiple myeloma. Created by COPASI 4.25 (Build 207) This model is described in the article: The Role of the Innate Immune System in Oncolytic Virotherapy Tuan Anh Phan and Jianjun Paul TianComputational and Mathematical Methods in Medicine (2017) 6587258Abstract: The complexity of the immune responses is a major challenge in current virotherapy. This study incorporates the innate immune response into our basic model for virotherapy and investigates how the innate immunity affects the outcome of virotherapy. The viral therapeutic dynamics is largely determined by the viral burst size, relative innate immune killing rate, and relative innate immunity decay rate. The innate immunity may complicate virotherapy in the way of creating more equilibria when the viral burst size is not too big, while the dynamics is similar to the system without innate immunity when the viral burst size is big.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000749": {
        "name": "Reppas2015 - tumor control via alternating immunostimulating and immunosuppressive phases",
        "description": "The paper describes a model of tumor control via alternating immunostimulating and immunosuppressive phases. Created by COPASI 4.25 (Build 207) This model is described in the article: In silico tumor control induced via alternating immunostimulating and immunosuppressive phasesAI Reppas, JCL Alfonso, and H HatzikirouVirulence 7:2, 174--186Abstract: Despite recent advances in the field of Oncoimmunology, the success potential of immunomodulatory therapies against cancer remains to be elucidated. One of the reasons is the lack of understanding on the complex interplay between tumor growth dynamics and the associated immune system responses. Toward this goal, we consider a mathematical model of vascularized tumor growth and the corresponding effector cell recruitment dynamics. Bifurcation analysis allows for the exploration of model’s dynamic behavior and the determination of these parameter regimes that result in immune-mediated tumor control. In this work, we focus on a particular tumor evasion regime that involves tumor and effector cell concentration oscillations of slowly increasing and decreasing amplitude, respectively. Considering a temporal multiscale analysis, we derive an analytically tractable mapping of model solutions onto a weakly negatively damped harmonic oscillator. Based on our analysis, we propose a theory-driven intervention strategy involving immunostimulating and immunosuppressive phases to induce long-term tumor control.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000751": {
        "name": "Wilkie2013b - immune-induced cancer dormancy and immune evasion-basic",
        "description": "The paper describes a basic model of immune-induced cancer dormancy and immune evasion. Created by COPASI 4.25 (Build 207) This model is described in the article: Mathematical models of immune-induced cancer dormancy and the emergence of immune evasionKathleen P. Wilkie and Philip HahnfeldtInterface Focus 3: 20130010Abstract: Cancer dormancy, a state in which cancer cells persist in a host without sig- nificant growth, is a natural forestallment of progression to manifest disease and is thus of great clinical interest. Experimental work in mice suggests that in immune-induced dormancy, the longer a cancer remains dormant in a host, the more resistant the cancer cells become to cytotoxic T-cell-mediated killing. In this work, mathematical models are used to analyse the possible causative mechanisms of cancer escape from immune-induced dormancy. Using a data-driven approach, both decaying efficacy in immune predation and immune recruitment are analysed with results suggesting that decline in recruitment is a stronger determinant of escape than increased resistance to predation. Using a mechanistic approach, the existence of an immune- resistant cancer cell subpopulation is considered, and the effects on cancer dormancy and potential immunoediting mechanisms of cancer escape are analysed and discussed. The immunoediting mechanism assumes that the immune system selectively prunes the cancer of immune-sensitive cells, which is shown to cause an initially heterogeneous population to become a more homogeneous, and more resistant, population. The fact that this selec- tion may result in the appearance of decreasing efficacy in T-cell cytotoxic effect with time in dormancy is also demonstrated. This work suggests that through actions that temporarily delay cancer growth through the targeted removal of immune-sensitive subpopulations, the immune response may actually progress the cancer to a more aggressive state.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide.Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000752": {
        "name": "Wilkie2013r - immune-induced cancer dormancy and immune evasion-resistance",
        "description": "The paper describes a model of immune-induced cancer dormancy and immune evasion with resistance. Created by COPASI 4.25 (Build 207) This model is described in the article: Mathematical models of immune-induced cancer dormancy and the emergence of immune evasionKathleen P. Wilkie and Philip HahnfeldtInterface Focus 3: 20130010Abstract: Cancer dormancy, a state in which cancer cells persist in a host without sig- nificant growth, is a natural forestallment of progression to manifest disease and is thus of great clinical interest. Experimental work in mice suggests that in immune-induced dormancy, the longer a cancer remains dormant in a host, the more resistant the cancer cells become to cytotoxic T-cell-mediated killing. In this work, mathematical models are used to analyse the possible causative mechanisms of cancer escape from immune-induced dormancy. Using a data-driven approach, both decaying efficacy in immune predation and immune recruitment are analysed with results suggesting that decline in recruitment is a stronger determinant of escape than increased resistance to predation. Using a mechanistic approach, the existence of an immune- resistant cancer cell subpopulation is considered, and the effects on cancer dormancy and potential immunoediting mechanisms of cancer escape are analysed and discussed. The immunoediting mechanism assumes that the immune system selectively prunes the cancer of immune-sensitive cells, which is shown to cause an initially heterogeneous population to become a more homogeneous, and more resistant, population. The fact that this selec- tion may result in the appearance of decreasing efficacy in T-cell cytotoxic effect with time in dormancy is also demonstrated. This work suggests that through actions that temporarily delay cancer growth through the targeted removal of immune-sensitive subpopulations, the immune response may actually progress the cancer to a more aggressive state.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide.Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000753": {
        "name": "Figueredo2013/1 - immunointeraction base model",
        "description": "The paper describes a basic model of immune-itumor interaction.Created by COPASI 4.25 (Build 207) This model is described in the article: Investigating mathematical models of immuno-interactions with early-stage cancer under an agent-based modelling perspectiveGrazziela P Figueredo, Peer-Olaf Siebers, Uwe Aickelin Kathleen BMC Bioinformatics 2013, 14(Suppl 6):S6Abstract: Many advances in research regarding immuno-interactions with cancer were developed with the help of ordinary differential equation (ODE) models. These models, however, are not effectively capable of representing problems involving individual localisation, memory and emerging properties, which are common characteristics of cells and molecules of the immune system. Agent-based modelling and simulation is an alternative paradigm to ODE models that overcomes these limitations. In this paper we investigate the potential contribution of agent-based modelling and simulation when compared to ODE modelling and simulation. We seek answers to the following questions: Is it possible to obtain an equivalent agent-based model from the ODE formulation? Do the outcomes differ? Are there any benefits of using one method compared to the other? To answer these questions, we have considered three case studies using established mathematical models of immune interactions with early-stage cancer. These case studies were re-conceptualised under an agent-based perspective and the simulation results were then compared with those from the ODE models. Our results show that it is possible to obtain equivalent agent-based models (i.e. implementing the same mechanisms); the simulation output of both types of models however might differ depending on the attributes of the system to be modelled. In some cases, additional insight from using agent-based modelling was obtained. Overall, we can confirm that agent-based modelling is a useful addition to the tool set of immunologists, as it has extra features that allow for simulations with characteristics that are closer to the biological phenomena.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000754": {
        "name": "Figueredo2013/2 - immunointeraction model with IL2",
        "description": "The paper describes a model of immune-itumor interaction with IL2.Created by COPASI 4.25 (Build 207) This model is described in the article: Investigating mathematical models of immuno-interactions with early-stage cancer under an agent-based modelling perspectiveGrazziela P Figueredo, Peer-Olaf Siebers, Uwe Aickelin Kathleen BMC Bioinformatics 2013, 14(Suppl 6):S6Abstract: Many advances in research regarding immuno-interactions with cancer were developed with the help of ordinary differential equation (ODE) models. These models, however, are not effectively capable of representing problems involving individual localisation, memory and emerging properties, which are common characteristics of cells and molecules of the immune system. Agent-based modelling and simulation is an alternative paradigm to ODE models that overcomes these limitations. In this paper we investigate the potential contribution of agent-based modelling and simulation when compared to ODE modelling and simulation. We seek answers to the following questions: Is it possible to obtain an equivalent agent-based model from the ODE formulation? Do the outcomes differ? Are there any benefits of using one method compared to the other? To answer these questions, we have considered three case studies using established mathematical models of immune interactions with early-stage cancer. These case studies were re-conceptualised under an agent-based perspective and the simulation results were then compared with those from the ODE models. Our results show that it is possible to obtain equivalent agent-based models (i.e. implementing the same mechanisms); the simulation output of both types of models however might differ depending on the attributes of the system to be modelled. In some cases, additional insight from using agent-based modelling was obtained. Overall, we can confirm that agent-based modelling is a useful addition to the tool set of immunologists, as it has extra features that allow for simulations with characteristics that are closer to the biological phenomena.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000756": {
        "name": "Figueredo2013/3 - immunointeraction full model",
        "description": "The paper describes a full model of immune-itumor interaction.Created by COPASI 4.25 (Build 207) This model is described in the article: Investigating mathematical models of immuno-interactions with early-stage cancer under an agent-based modelling perspectiveGrazziela P Figueredo, Peer-Olaf Siebers, Uwe Aickelin Kathleen BMC Bioinformatics 2013, 14(Suppl 6):S6Abstract: Many advances in research regarding immuno-interactions with cancer were developed with the help of ordinary differential equation (ODE) models. These models, however, are not effectively capable of representing problems involving individual localisation, memory and emerging properties, which are common characteristics of cells and molecules of the immune system. Agent-based modelling and simulation is an alternative paradigm to ODE models that overcomes these limitations. In this paper we investigate the potential contribution of agent-based modelling and simulation when compared to ODE modelling and simulation. We seek answers to the following questions: Is it possible to obtain an equivalent agent-based model from the ODE formulation? Do the outcomes differ? Are there any benefits of using one method compared to the other? To answer these questions, we have considered three case studies using established mathematical models of immune interactions with early-stage cancer. These case studies were re-conceptualised under an agent-based perspective and the simulation results were then compared with those from the ODE models. Our results show that it is possible to obtain equivalent agent-based models (i.e. implementing the same mechanisms); the simulation output of both types of models however might differ depending on the attributes of the system to be modelled. In some cases, additional insight from using agent-based modelling was obtained. Overall, we can confirm that agent-based modelling is a useful addition to the tool set of immunologists, as it has extra features that allow for simulations with characteristics that are closer to the biological phenomena.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000757": {
        "name": "Abernathy2016 - glioblastoma treatment",
        "description": "The paper describes a model of glioblastoma. Created by COPASI 4.25 (Build 207) This model is described in the article: Modeling the Treatment of Glioblastoma Multiforme and Cancer Stem Cells with Ordinary Differential EquationsKristen Abernathy and Jeremy Burke BMC Computational and Mathematical Methods in Medicine Volume 2016, Article ID 1239861, 11 pagesAbstract: Despite improvements in cancer therapy and treatments, tumor recurrence is a common event in cancer patients. One explanation of recurrence is that cancer therapy focuses on treatment of tumor cells and does not eradicate cancer stem cells (CSCs). CSCs are postulated to behave similar to normal stem cells in that their role is to maintain homeostasis. That is, when the population of tumor cells is reduced or depleted by treatment, CSCs will repopulate the tumor, causing recurrence. In this paper, we study the application of the CSC Hypothesis to the treatment of glioblastoma multiforme by immunotherapy. We extend the work of Kogan et al. (2008) to incorporate the dynamics of CSCs, prove the existence of a recurrence state, and provide an analysis of possible cancerous states and their dependence on treatment levels.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000758": {
        "name": "Babbs2012 - immunotherapy",
        "description": "The paper describes a simple model of tumor immunotherapy. Created by COPASI 4.25 (Build 207) This model is described in the article: Predicting success or failure of immunotherapy for cancer: insights from a clinically applicable mathematical model Charles F BabbsAm J Cancer Res 2012;2(2):204-213Abstract: The objective of this study was to create a clinically applicable mathematical model of immunotherapy for cancer and use it to explore differences between successful and unsuccessful treatment scenarios. The simplified predator-prey model includes four lumped parameters: tumor growth rate, g; immune cell killing efficiency, k; immune cell signaling factor, λ; and immune cell half-life decay, μ. The predator-prey equations as functions of time, t, for nor- malized tumor cell numbers, y, (the prey) and immunocyte numbers, x, (the predators) are: dy/dt = gy – kx and dx/dt = λxy – μx. A parameter estimation procedure that capitalizes on available clinical data and the timing of clinically observable phenomena gives mid-range benchmarks for parameters representing the unstable equilibrium case in which the tumor neither grows nor shrinks. Departure from this equilibrium results in oscillations in tumor cell num- bers and in many cases complete elimination of the tumor. Several paradoxical phenomena are predicted, including increasing tumor cell numbers prior to a population crash, apparent cure with late recurrence, one or more cycles of tumor growth prior to eventual tumor elimination, and improved tumor killing with initially weaker immune parame- ters or smaller initial populations of immune cells. The model and the parameter estimation techniques are easily adapted to various human cancers that evoke an immune response. They may help clinicians understand and predict certain strange and unexpected effects in the world of tumor immunity and lead to the design of clinical trials to test improved treatment protocols for patients.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000759": {
        "name": "den Breems2015 - macrophage in cancer",
        "description": "The paper describes a model of re-polarisation of M2 and M1 macrophages and its role on cancer outcomes. Created by COPASI 4.25 (Build 207) This model is described in the article: The re-polarisation of M2 and M1 macrophages and its role on cancer outcomesden Breems, Nicoline Y.; Eftimie, RalucaJournal of Theoretical Biology, 390, 23-39Abstract: The anti-tumour and pro-tumour roles of Th1/Th2 immune cells and M1/M2 macrophages have been documented by numerous experimental studies. How- ever, it is still unknown how these immune cells interact with each other to control tumour dynamics. Here, we use a mathematical model for the inter- actions between mouse melanoma cells, Th2/Th1 cells and M2/M1 macro- phages, to investigate the unknown role of the re-polarisation between M1 and M2 macrophages on tumour growth. The results show that tumour growth is associated with a type-II immune response described by large num- bers of Th2 and M2 cells. Moreover, we show that: (i) the ratio k of the transition rates k12 (for the re-polarisation M1→M2) and k21 (for the re- polarisation M2→M1) is important in reducing tumour population, and (ii) the particular values of these transition rates control the delay in tumour growth and the final tumour size. We also perform a sensitivity analysis to investigate the effect of various model parameters on changes in the tumour cell population, and confirm that the ratio k alone and the ratio of M2 and M1 macrophage populations at earlier times (e.g., day 7), cannot always predict the final tumour size.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000760": {
        "name": "Feizabadi2011/1 - immunodeficiency in cancer core model",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>The paper describes a basic model of immune-cancer interaction. Created by COPASI 4.25 (Build 207) This model is described in the article: Modeling the Effects of a Simple Immune System and Immunodeficiency on the Dynamics of Conjointly Growing Tumor and Normal CellsMitra Shojania Feizabadi and Tarynn M. WittenInternational Journal of Biological Sciences 2011; 7(6):700-707Abstract: In this paper, we develop a theoretical contribution towards the understanding of the complex behavior of conjoint tumor-normal cell growth under the influence of immuno-chemotheraputic agents under simple immune system response. In particular, we consider a core model for the interaction of tumor cells with the surrounding normal cells. We then add the effects of a simple immune system, and both immune-suppression factors and immuno-chemotherapeutic agents as well. Through a series of numerical simulations, we illustrate that the interdependency of tumor-normal cells, together with choice of drug and the nature of the immunodeficiency, leads to a variety of interesting patterns in the evolution of both the tumor and the normal cell populations.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information.</pre>      </body>    </notes>"
    },
    "BIOMD0000000764": {
        "name": "Malinzi2019 - chemovirotherapy",
        "description": "The paper describes a model of oncolytic virothherapy. Created by COPASI 4.25 (Build 207) This model is described in the article: Mathematical Analysis of a Mathematical Model of Chemovirotherapy: Effect of Drug Infusion Method Joseph Malinzi Computational and Mathematical Methods in Medicine Volume 2019, Article ID 7576591, 16 pages Abstract: IA mathematical model for the treatment of cancer using chemovirotherapy is developed with the aim of determining the efficacy of three drug infusion methods: constant, single bolus, and periodic treatments. The model is in the form of ODEs and is further extended into DDEs to account for delays as a result of the infection of tumor cells by the virus and chemotherapeutic drug responses. Analysis of the model is carried out for each of the three drug infusion methods. Analytic solutions are determined where possible and stability analysis of both steady state solutions for the ODEs and DDEs is presented. The results indicate that constant and periodic drug infusion methods are more efficient compared to a single bolus injection. Numerical simulations show that with a large virus burst size, irrespective of the drug infusion method, chemovirotherapy is highly effective compared to either treatments. The simulations further show that both delays increase the period within which a tumor can be cleared from body tissue.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000766": {
        "name": "Macnamara2015/1 - virotherapy full model",
        "description": "The paper describes a full model of oncolytic virotherapy. Created by COPASI 4.25 (Build 207) This model is described in the article: Memory versus effector immune responses in oncolytic virotherapiesCicely Macnamara, Raluca Eftimie Abstract: The main priority when designing cancer immuno-therapies has been to seek viable biological mechanisms that lead to permanent cancer eradica- tion or cancer control. Understanding the delicate balance between the role of effector and memory cells on eliminating cancer cells remains an elusive problem in immunology. Here we make an initial investigation into this problem with the help of a mathematical model for oncolytic virotherapy; although the model can in fact be made general enough to be applied also to other immunological problems. Our results show that long-term cancer con- trol is associated with a large number of persistent effector cells (irrespective of the initial peak in effector cell numbers). However, this large number of persistent effector cells is sustained by a relatively large number of memory cells. Moreover, we show that cancer control from a dormant state cannot be predicted by the size of the memory population.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000767": {
        "name": "Macnamara2015/2 - virotherapy virus-free submodel",
        "description": "The paper describes a  submodel of oncolytic virotherapy. Created by COPASI 4.25 (Build 207) This model is described in the article: Memory versus effector immune responses in oncolytic virotherapiesCicely Macnamara, Raluca Eftimie Abstract: The main priority when designing cancer immuno-therapies has been to seek viable biological mechanisms that lead to permanent cancer eradica- tion or cancer control. Understanding the delicate balance between the role of effector and memory cells on eliminating cancer cells remains an elusive problem in immunology. Here we make an initial investigation into this problem with the help of a mathematical model for oncolytic virotherapy; although the model can in fact be made general enough to be applied also to other immunological problems. Our results show that long-term cancer con- trol is associated with a large number of persistent effector cells (irrespective of the initial peak in effector cell numbers). However, this large number of persistent effector cells is sustained by a relatively large number of memory cells. Moreover, we show that cancer control from a dormant state cannot be predicted by the size of the memory population.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000768": {
        "name": "Eftimie2010 - immunity to melanoma",
        "description": "The paper describes a model of immunity to melanoma. Created by COPASI 4.25 (Build 207) This model is described in the article: Modeling anti-tumor Th1 and Th2 immunity in the rejection of melanoma Raluca Eftimie, Jonathan L. Bramson, David J.D. Earn Journal of Theoretical Biology 265 (2010) 467–480Abstract: Recent experiments indicate that CD4+ Th2 cells can reject skin tumors in mice, while CD4+ Th1 cells cannot (Mattes et al., 2003; Zhang et al., 2009). These results are surprising because CD4+ Th1 cells are typically considered to be capable of tumor rejection. We used mathematical models to investigate this unexpected outcome. We found that neither CD4+ Th1 nor CD4+ Th2 cells could eliminate the cancer cells when acting alone, but that tumor elimination could be induced by recruitment of eosinophils by the Th2 cells. These recruited eosinophils had unexpected indirect effects on the decay rate of type 2 cytokines and the rate at which Th2 cells are inactivated through interactions with cancer cells. Strikingly, the presence of eosinophils impacted tumor growth more significantly than the release of tumor-suppressing cytokines such as IFN-g and TNF-a. Our simulations suggest that novel strategies to enhance eosinophil recruitment into skin tumors may improve cancer immunotherapies. To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000769": {
        "name": "Eftimie2017/2 - interaction of Th and macrophage in melanoma",
        "description": "The paper describes a model of interaction of Th cells and macrophage in melanoma. Created by COPASI 4.25 (Build 207) This model is described in the article: Modelling and investigation of the CD4 T cells – Macrophages paradox in melanoma immunotherapiesRaluca Eftimie, Haneen HamamJournal of Theoretical Biology 420 (2017) 82–104 Abstract: It is generally accepted that tumour cells can be eliminated by M1 anti-tumour macrophages and CD8+ T cells. However, experimental results over the past 10–15 years have shown that B16 mouse melanoma cells can be eliminated by the CD4+ T cells alone (either Th1 or Th2 sub-types), in the absence of CD8+ T cells. In some studies, elimination of B16 melanoma was associated with a Th1 immune response (i.e., elimination occurred in the presence of cytokines produced by Th1 cells), while in other studies melanoma elimination was associated with a Th2 immune response (i.e., elimination occurred in the presence of cytokines produced by Th2 cells). Moreover, macrophages have been shown to be present inside the tumours, during both Th1 and Th2 immune responses. To investigate the possible biological mechanisms behind these apparently contradictory results, we develop a class of mathematical models for the dynamics of Th1 and Th2 cells, and M1 and M2 macrophages in the presence/absence of tumour cells. Using this mathematical model, we show that depending on the re- polarisation rates between M1 and M2 macrophages, we obtain tumour elimination in the presence of a type-I immune response (i.e., more Th1 and M1 cells, compared to the Th2 and M2 cells), or in the presence of a type- II immune response (i.e., more Th2 and M2 cells). Moreover, tumour elimination is also possible in the presence of a mixed type-I/type-II immune response. Tumour growth always occurs in the presence of a type-II immune response, as observed experimentally. Finally, tumour dormancy is the result of a delicate balance between the pro-tumour effects of M2 cells and the anti-tumour effects of M1 and Th1 cells.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000770": {
        "name": "Eftimie2017/1 - interaction of Th and macrophage",
        "description": "The paper describes a model of interaction of Th cells and macrophage in melanoma. Created by COPASI 4.25 (Build 207) This model is described in the article: Modelling and investigation of the CD4 T cells – Macrophages paradox in melanoma immunotherapiesRaluca Eftimie, Haneen HamamJournal of Theoretical Biology 420 (2017) 82–104 Abstract: It is generally accepted that tumour cells can be eliminated by M1 anti-tumour macrophages and CD8+ T cells. However, experimental results over the past 10–15 years have shown that B16 mouse melanoma cells can be eliminated by the CD4+ T cells alone (either Th1 or Th2 sub-types), in the absence of CD8+ T cells. In some studies, elimination of B16 melanoma was associated with a Th1 immune response (i.e., elimination occurred in the presence of cytokines produced by Th1 cells), while in other studies melanoma elimination was associated with a Th2 immune response (i.e., elimination occurred in the presence of cytokines produced by Th2 cells). Moreover, macrophages have been shown to be present inside the tumours, during both Th1 and Th2 immune responses. To investigate the possible biological mechanisms behind these apparently contradictory results, we develop a class of mathematical models for the dynamics of Th1 and Th2 cells, and M1 and M2 macrophages in the presence/absence of tumour cells. Using this mathematical model, we show that depending on the re- polarisation rates between M1 and M2 macrophages, we obtain tumour elimination in the presence of a type-I immune response (i.e., more Th1 and M1 cells, compared to the Th2 and M2 cells), or in the presence of a type- II immune response (i.e., more Th2 and M2 cells). Moreover, tumour elimination is also possible in the presence of a mixed type-I/type-II immune response. Tumour growth always occurs in the presence of a type-II immune response, as observed experimentally. Finally, tumour dormancy is the result of a delicate balance between the pro-tumour effects of M2 cells and the anti-tumour effects of M1 and Th1 cells.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000778": {
        "name": "Wei2017 - tumor, T cell and cytokine interaction",
        "description": "The paper describes a model of tumor-immune interaction. Created by COPASI 4.25 (Build 207) This model is described in the article: Periodically Pulsed Immunotherapy in a Mathematical Model of Tumor, CD4+ T Cells, and Antitumor Cytokine InteractionsHsiu-Chuan Wei, Jui-Ling Yu, Chia-Yu Hsu Computational and Mathematical Methods in Medicine Volume 2017, Article ID 2906282, 12 pages Abstract: Immunotherapy is one of the most recent approaches for controlling and curing malignant tumors. In this paper, we consider a mathematical model of periodically pulsed immunotherapy using CD4+ T cells and an antitumor cytokine. Mathematical analyses are performed to determine the threshold of a successful treatment. The interindividual variability is explored by one-, two-, and three-parameter bifurcation diagrams for a nontreatment case. Numerical simulation conducted in this paper shows that (i) the tumor can be regulated by administering CD4+ T cells alone in a patient with a strong immune system or who has been diagnosed at an early stage, (ii) immunotherapy with a large amount of an antitumor cytokine can boost the immune system to remit or even to suppress tumor cells completely, and (iii) through polytherapy the tumor can be kept at a smaller size with reduced dosages.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000780": {
        "name": "Wang2016/1 - oncolytic efficacy of M1 virus-SNTM model",
        "description": "The paper describes a model of oncolytic virotherapy. Created by COPASI 4.25 (Build 207) This model is described in the article: A mathematical model verifying potent oncolytic efficacy of M1 virusZizi Wang, Zhiming Guo, Huaqin Peng Mathematical Biosciences 276 (2016) 19–27Abstract: Motivated by the latest findings in a recent medical experiment [19] which identify a naturally occurring alphavirus (M1) as a novel selective killer targeting zinc-finger antiviral protein (ZAP)-deficient cancer cells, we propose a mathematical model to illustrate the growth of normal cells, tumor cells and the M1 virus with limited nutrient. In order to better understand biological mechanisms, we discuss two cases of the model: without competition and with competition. In the first part, the explicit threshold condi- tions for the persistence of normal cells (or tumor cells) is obtained accompanying with the biological explanations. The second part indicates that when competing with tumor cells, the normal cells will ex- tinct if M1 virus is ignored; Whereas, when M1 virus is considered, the growth trend of normal cells is similar to the one without competition. And by using uniformly strong repeller theorem, the minimum effective dosage of medication is explicitly found which is not reported in [19]. Furthermore, numerical simulations and corresponding biological interpretations are given to support our results.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000781": {
        "name": "Wang2016/2 - oncolytic efficacy of M1 virus-SNT model",
        "description": "The paper describes a model of oncolytic virotherapy. Created by COPASI 4.25 (Build 207) This model is described in the article: A mathematical model verifying potent oncolytic efficacy of M1 virusZizi Wang, Zhiming Guo, Huaqin Peng Mathematical Biosciences 276 (2016) 19–27Abstract: Motivated by the latest findings in a recent medical experiment [19] which identify a naturally occurring alphavirus (M1) as a novel selective killer targeting zinc-finger antiviral protein (ZAP)-deficient cancer cells, we propose a mathematical model to illustrate the growth of normal cells, tumor cells and the M1 virus with limited nutrient. In order to better understand biological mechanisms, we discuss two cases of the model: without competition and with competition. In the first part, the explicit threshold condi- tions for the persistence of normal cells (or tumor cells) is obtained accompanying with the biological explanations. The second part indicates that when competing with tumor cells, the normal cells will ex- tinct if M1 virus is ignored; Whereas, when M1 virus is considered, the growth trend of normal cells is similar to the one without competition. And by using uniformly strong repeller theorem, the minimum effective dosage of medication is explicitly found which is not reported in [19]. Furthermore, numerical simulations and corresponding biological interpretations are given to support our results.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000782": {
        "name": "Wang2016/3 - oncolytic efficacy of M1 virus-SN model",
        "description": "The paper describes a basic model of oncolytic virotherapy. Created by COPASI 4.25 (Build 207) This model is described in the article: A mathematical model verifying potent oncolytic efficacy of M1 virusZizi Wang, Zhiming Guo, Huaqin Peng Mathematical Biosciences 276 (2016) 19–27Abstract: Motivated by the latest findings in a recent medical experiment [19] which identify a naturally occurring alphavirus (M1) as a novel selective killer targeting zinc-finger antiviral protein (ZAP)-deficient cancer cells, we propose a mathematical model to illustrate the growth of normal cells, tumor cells and the M1 virus with limited nutrient. In order to better understand biological mechanisms, we discuss two cases of the model: without competition and with competition. In the first part, the explicit threshold condi- tions for the persistence of normal cells (or tumor cells) is obtained accompanying with the biological explanations. The second part indicates that when competing with tumor cells, the normal cells will ex- tinct if M1 virus is ignored; Whereas, when M1 virus is considered, the growth trend of normal cells is similar to the one without competition. And by using uniformly strong repeller theorem, the minimum effective dosage of medication is explicitly found which is not reported in [19]. Furthermore, numerical simulations and corresponding biological interpretations are given to support our results.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000791": {
        "name": "Wilson2012 - tumor vaccine efficacy",
        "description": "The paper describes a model of antitumor vaccine therapy.Created by COPASI 4.25 (Build 207) This model is described in the article: A Mathematical Model of the Enhancement of Tumor Vaccine Efficacy by ImmunotherapyShelby Wilson and Doron LevyBull Math Biol. 2012 July ; 74(7)Abstract: TGF-β is an immunoregulatory protein that contributes to inadequate antitumor immune responses in cancer patients. Recent experimental data suggests that TGF-β inhibition alone, provides few clinical benefits, yet it can significantly amplify the anti-tumor immune response when combined with a tumor vaccine. We develop a mathematical model in order to gain insight into the cooperative interaction between anti-TGF-β and vaccine treatments. The mathematical model follows the dynamics of the tumor size, TGF-β concentration, activated cytotoxic effector cells, and regulatory T cells. Using numerical simulations and stability analysis, we study the following scenarios: a control case of no treatment, anti-TGF-β treatment, vaccine treatment, and combined anti-TGF-β vaccine treatments. We show that our model is capable of capturing the observed experimental results, and hence can be potentially used in designing future experiments involving this approach to immunotherapy.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000798": {
        "name": "Sharp2019 - AML",
        "description": "The paper describes a model of acute myeloid leukaemia. Created by COPASI 4.26 (Build 213) This model is described in the article: Optimal control of acute myeloid leukaemia Jesse A. Sharp, Alexander P Browning, Tarunendu Mapder, Kevin Burrage, Matthew J SimpsonJournal of Theoretical Biology 470 (2019) 30–42 Abstract: Acute myeloid leukaemia (AML) is a blood cancer affecting haematopoietic stem cells. AML is routinely treated with chemotherapy, and so it is of great interest to develop optimal chemotherapy treatment strategies. In this work, we incorporate an immune response into a stem cell model of AML, since we find that previous models lacking an immune response are inappropriate for deriving optimal control strategies. Using optimal control theory, we produce continuous controls and bang-bang controls, corre- sponding to a range of objectives and parameter choices. Through example calculations, we provide a practical approach to applying optimal control using Pontryagin’s Maximum Principle. In particular, we describe and explore factors that have a profound influence on numerical convergence. We find that the convergence behaviour is sensitive to the method of control updating, the nature of the control, and to the relative weighting of terms in the objective function. All codes we use to implement optimal control are made available.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000801": {
        "name": "Sturrock2015 - glioma growth",
        "description": "The paper describes a model of glioma. Created by COPASI 4.26 (Build 213) This model is described in the article: A mathematical model of pre-diagnostic glioma growth Marc Sturrock, Wenrui Hao, Judith Schwartzbaum, Grzegorz A. Rempala J Theor Biol. 2015 September 7; 380: 299–308 Abstract: Due to their location, the malignant gliomas of the brain in humans are very difficult to treat in advanced stages. Blood-based biomarkers for glioma are needed for more accurate evaluation of treatment response as well as early diagnosis. However, biomarker research in primary brain tumors is challenging given their relative rarity and genetic diversity. It is further complicated by variations in the permeability of the blood brain barrier that affects the amount of marker released into the bloodstream. Inspired by recent temporal data indicating a possible decrease in serum glucose levels in patients with gliomas yet to be diagnosed, we present an ordinary differential equation model to capture early stage glioma growth. The model contains glioma-glucose-immune interactions and poses a potential mechanism by which this glucose drop can be explained. We present numerical simulations, parameter sensitivity analysis, linear stability analysis and a numerical experiment whereby we show how a dormant glioma can become malignant.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000802": {
        "name": "Hoffman2018- ADCC against cancer",
        "description": "The paper describes a model of ADCC. Created by COPASI 4.26 (Build 213) This model is described in the article: A mathematical model of antibody-dependent cellular cytotoxicity (ADCC) F. Hoffman, D. Gavaghan, J. Osborne, I.P. Barrett, T. You, H. Ghadially, R. Sainson, R.W. Wilkinson, H.M. ByrneJournal of Theoretical Biology 436 (2018) 39–50 Abstract: Immunotherapies exploit the immune system to target and kill cancer cells, while sparing healthy tis- sue. Antibody therapies, an important class of immunotherapies, involve the binding to specific antigens on the surface of the tumour cells of antibodies that activate natural killer (NK) cells to kill the tu- mour cells. Preclinical assessment of molecules that may cause antibody-dependent cellular cytotoxicity (ADCC) involves co-culturing cancer cells, NK cells and antibody in vitro for several hours and measuring subsequent levels of tumour cell lysis. Here we develop a mathematical model of such an in vitro ADCC assay, formulated as a system of time-dependent ordinary differential equations and in which NK cells kill cancer cells at a rate which depends on the amount of antibody bound to each cancer cell. Numerical simulations generated using experimentally-based parameter estimates reveal that the system evolves on two timescales: a fast timescale on which antibodies bind to receptors on the surface of the tumour cells, and NK cells form complexes with the cancer cells, and a longer time-scale on which the NK cells kill the cancer cells. We construct approximate model solutions on each timescale, and show that they are in good agreement with numerical simulations of the full system. Our results show how the processes involved in ADCC change as the initial concentration of antibody and NK-cancer cell ratio are varied. We use these results to explain what information about the tumour cell kill rate can be extracted from the cytotoxicity assays.To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information."
    },
    "BIOMD0000000877": {
        "name": "Ontah2019 - Dynamic analysis of a tumor treatment model using oncolytic virus and chemotherapy with saturated infection rate",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>This is a mathematical model describing the treatment of tumors using oncolytic virus and chemotherapy. The model is comprised of nonlinear ordinary differential equations describing the interactions between uninfected tumor cells, infected tumor cells, an oncolytic virus, and chemotherapy.</pre>      </body>    </notes>"
    },
    "BIOMD0000000879": {
        "name": "Rodrigues2019 - A mathematical model for chemoimmunotherapy of chronic lymphocytic leukemia",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>THis is a simple ordinary differential equation model describing chemoimmunotherapy of chronic lymphocytic leukemia, including descriptions of the combinatorial effects of chemotherapy and adoptive cellular immunotherapy.</pre>      </body>    </notes>"
    },
    "BIOMD0000000880": {
        "name": "Trisilowati2018 - Optimal control of tumor-immune system interaction with treatment",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>This is a mathematical model of a growing tumor and its interaction with the immune system. The model consists of four populations: tumor cells, dendritic cells (representing the innate immune system), cytotoxic T cells, and helper T cells (as the specific immune system). The model is comprised of a system of ordinary differential equations.</pre>      </body>    </notes>"
    },
    "BIOMD0000000813": {
        "name": "Anderson2015 - Qualitative behavior of systems of tumor-CD4+-cytokine interactions with treatments",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>This is a mathematical model describing tumor-CD4+-cytokine interactions, with specific emphasis on the role that CD4+ T lymphocytes play in tumor regression.</pre>      </body>    </notes>"
    },
    "BIOMD0000000888": {
        "name": "Unni2019 - Mathematical Modeling, Analysis, and Simulation of Tumor Dynamics with Drug Interventions",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>Mathematical Modeling, Analysis, and Simulation of Tumor Dynamics with Drug InterventionsPranav Unni 1 and Padmanabhan SeshaiyerAbstractOver the last few decades, there have been significant developments in theoretical, experimental, and clinical approaches to understand the dynamics of cancer cells and their interactions with the immune system. These have led to the development of important methods for cancer therapy including virotherapy, immunotherapy, chemotherapy, targeted drug therapy, and many others. Along with this, there have also been some developments on analytical and computational models to help provide insights into clinical observations. This work develops a new mathematical model that combines important interactions between tumor cells and cells in the immune systems including natural killer cells, dendritic cells, and cytotoxic CD8+ T cells combined with drug delivery to these cell sites. These interactions are described via a system of ordinary differential equations that are solved numerically. A stability analysis of this model is also performed to determine conditions for tumor-free equilibrium to be stable. We also study the influence of proliferation rates and drug interventions in the dynamics of all the cells involved. Another contribution is the development of a novel parameter estimation methodology to determine optimal parameters in the model that can reproduce a given dataset. Our results seem to suggest that the model employed is a robust candidate for studying the dynamics of tumor cells and it helps to provide the dynamic interactions between the tumor cells, immune system, and drug-response systems.</pre>      </body>    </notes>"
    },
    "BIOMD0000000891": {
        "name": "Khajanchi2019 - Stability Analysis of a Mathematical Model forGlioma-Immune Interaction under OptimalTherapy",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>Stability Analysis of a Mathematical Model for Glioma-Immune Interaction under Optimal TherapySubhas KhajanchiAbstractWe investigate a mathematical model using a system of coupled ordinary differential equations, which describes the interplay of malignant glioma cells, macrophages, glioma specific CD8+T cells and the immunotherapeutic drug Adoptive Cellular Immunotherapy (ACI). To better understand under what circumstances the glioma cells can be eliminated, we employ the theory of optimal control. We investigate the dynamics of the system by observing biologically feasible equilibrium points and their stability analysis before administration of the external therapy ACI. We solve an optimal control problem with an objective functional which minimizes the glioma cell burden as well as the side effects of the treatment. We characterize our optimal control in terms of the solutions to the optimality system, in which the state system coupled with the adjoint system. Our model simulation demonstrates that the strength of treatment u1(t) plays an important role to eliminate the glioma cells. Finally, we derive an optimal treatment strategy and then solve it numerically.Keywords: malignant gliomas; stability analysis; optimal control; adoptive cellular immunotherapy</pre>      </body>    </notes>"
    },
    "BIOMD0000000894": {
        "name": "Bose2011 - Noise-assisted interactions of tumor and immune cells",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>Noise-assisted interactions of tumor and immune cells.Bose T1, Trimper S.Author information1    Institute of Physics, Martin-Luther-University, D-06099 Halle, Germany. thomas.bose@physik.uni-halle.deAbstractWe consider a three-state model comprising tumor cells, effector cells, and tumor-detecting cells under the influence of noises. It is demonstrated that inevitable stochastic forces existing in all three cell species are able to suppress tumor cell growth completely. Whereas the deterministic model does not reveal a stable tumor-free state, the auto-correlated noise combined with cross-correlation functions can either lead to tumor-dormant states, tumor progression, as well as to an elimination of tumor cells. The auto-correlation function exhibits a finite correlation time τ, while the cross-correlation functions shows a white-noise behavior. The evolution of each of the three kinds of cells leads to a multiplicative noise coupling. The model is investigated by means of a multivariate Fokker-Planck equation for small τ. The different behavior of the system is, above all, determined by the variation of the correlation time and the strength of the cross-correlation between tumor and tumor-detecting cells. The theoretical model is based on a biological background discussed in detail, and the results are tested using realistic parameters from experimental observations.</pre>      </body>    </notes>"
    },
    "BIOMD0000000900": {
        "name": "Bianca2013 - Persistence analysis in a Kolmogorov-type model for cancer-immune system competition",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>Persistence analysis in a Kolmogorov-type model for cancer-immune system competitionAIP Conference Proceedings 1558, 1797 (2013); https://doi.org/10.1063/1.4825874C. BiancaDipartimento di Scienze Matematiche, Politecnico di Torino, Torino, ItalyF. PappalardoDipartimento di Scienza del Farmaco, Università degli Studi di Catania, Catania, ItalyM. Pennisi and M. A. RagusaDipartimento di Matematica e Informatica, Università degli Studi di Catania, Catania, Italy</pre>      </body>    </notes>"
    },
    "BIOMD0000000904": {
        "name": "Admon2017 - Modelling tumor growth with immune response and drug using ordinary differential equations",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>Modelling tumor growth with immune response and drug using ordinary differential equationsMohd Rashid Admon, Normah MaanThis is a mathematical study about tumor growth from a different perspective, with the aim of predicting and/or controlling the disease. The focus is on the effect and interaction of tumor cell with immune and drug. This paper presents a mathematical model of immune response and a cycle phase specific drug using a system of ordinary differential equations. Stability analysis is used to produce stability regions for various values of certain parameters during mitosis. The stability region of the graph shows that the curve splits the tumor decay and growth regions in the absence of immune response. However, when immune response is present, the tumor growth region is decreased. When drugs are considered in the system, the stability region remains unchanged as the system with the presence of immune response but the population of tumor cells at interphase and metaphase is reduced with percentage differences of 1.27 and 1.53 respectively. The combination of immunity and drug to fight cancer provides a better method to reduce tumor population compared to immunity alone.</pre>      </body>    </notes>"
    },
    "BIOMD0000000908": {
        "name": "dePillis2013 - Mathematical modeling of regulatory T cell effects on renal cell carcinoma treatment",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>Mathematical modeling of regulatory T cell effects on renal cell carcinoma treatmentLisette dePillis 1, , Trevor Caldwell 2, , Elizabeth Sarapata 2, and  Heather Williams 2,1. \tDepartment of Mathematics, Harvey Mudd College, Claremont, CA 917112. \tHarvey Mudd College, Claremont, CA 91711, United States, United States, United States    AbstractWe present a mathematical model to study the effects of the regulatory T cells (Treg) on Renal Cell Carcinoma (RCC) treatment with sunitinib. The drug sunitinib inhibits the natural self-regulation of the immune system, allowing the effector components of the immune system to function for longer periods of time. This mathematical model builds upon our non-linear ODE model by de Pillis et al. (2009) [13] to incorporate sunitinib treatment, regulatory T cell dynamics, and RCC-specific parameters. The model also elucidates the roles of certain RCC-specific parameters in determining key differences between in silico patients whose immune profiles allowed them to respond well to sunitinib treatment, and those whose profiles did not.    Simulations from our model are able to produce results that reflect clinical outcomes to sunitinib treatment such as: (1) sunitinib treatments following standard protocols led to improved tumor control (over no treatment) in about 40% of patients; (2) sunitinib treatments at double the standard dose led to a greater response rate in about 15% the patient population; (3) simulations of patient response indicated improved responses to sunitinib treatment when the patient's immune strength scaling and the immune system strength coefficients parameters were low, allowing for a slightly stronger natural immune response.Keywords: Renal cell carcinoma, mathematical modeling., sunitinib, immune system, regulatory T cells.</pre>      </body>    </notes>"
    },
    "BIOMD0000000909": {
        "name": "dePillis2003 - The dynamics of an optimally controlled tumor model: A case study",
        "description": "&lt;notes xmlns=&quot;http://www.sbml.org/sbml/level2/version4&quot;&gt;      &lt;body xmlns=&quot;http://www.w3.org/1999/xhtml&quot;&gt;        &lt;pre&gt;The dynamics of an optimally controlled tumor model: A case studyL.GDe PillisabARadunskayaahttps://doi.org/10.1016/S0895-7177(03)00133-XAbstractWe present a phase-space analysis of a mathematical model of tumor growth with an immune response and chemotherapy. We prove that all orbits are bounded and must converge to one of several possible equilibrium points. Therefore, the long-term behavior of an orbit is classified according to the basin of attraction in which it starts. The addition of a drug term to the system can move the solution trajectory into a desirable basin of attraction. We show that the solutions of the model with a time-varying drug term approach the solutions of the system without the drug once traatment has stopped. We present numerical experiments in which optimal control therapy is able to drive the system into a desirable basin of attraction, whereas traditional pulsed chemotherapy is not.&lt;/pre&gt;      &lt;/body&gt;    &lt;/notes&gt;"
    },
    "BIOMD0000000910": {
        "name": "Isaeva2008 - Modelling of Anti-Tumour Immune Response Immunocorrective Effect of Weak Centimetre Electromagnetic Waves",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>Modelling of anti-tumour immune response: Immunocorrective effectof weak centimetre electromagnetic wavesO.G. Isaeva* and V.A. OsipovBogoliubov Laboratory of Theoretical Physics, Joint Institute for Nuclear Research, Dubna,Moscow Region, RussiaWe formulate the dynamical model for the anti-tumour immune response based onintercellular cytokine-mediated interactions with the interleukin-2 (IL-2) taken intoaccount. The analysis shows that the expression level of tumour antigens on antigenpresenting cells has a distinct influence on the tumour dynamics. At low antigenpresentation, a progressive tumour growth takes place to the highest possible value.At high antigen presentation, there is a decrease in tumour size to some value when thedynamical equilibrium between the tumour and the immune system is reached. In thecase of the medium antigen presentation, both these regimes can be realized dependingon the initial tumour size and the condition of the immune system. A pronouncedimmunomodulating effect (the suppression of tumour growth and the normalization ofIL-2 concentration) is established by considering the influence of low-intensityelectromagnetic microwaves as a parametric perturbation of the dynamical system. Thisfinding is in qualitative agreement with the recent experimental results onimmunocorrective effects of centimetre electromagnetic waves in tumour-bearing mice.Keywords: carcinogenesis; interleukin-2; modelling; anti-tumour immunity;electromagnetic waves</pre>      </body>    </notes>"
    },
    "BIOMD0000000911": {
        "name": "Merola2008 - An insight into tumor dormancy equilibrium via the analysis of its domain of attraction",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>An insight into tumor dormancy equilibrium via the analysis of its domain ofattractionA. Merola, C. Cosentino *, F. AmatoSchool of Computer and Biomedical Engineering, Universita` degli Studi Magna Græcia di Catanzaro, Campus ‘‘Salvatore Venuta’’, 88100 Catanzaro, ItalyA B S T R A C TThe trajectories of the dynamic system which regulates the competition between the populations ofmalignant cells and immune cells may tend to an asymptotically stable equilibrium in which the sizes ofthese populations do not vary, which is called tumor dormancy. Especially for lower steady-state sizes ofthe population of malignant cells, this equilibrium represents a desirable clinical condition since thetumor growth is blocked. In this context, it is of mandatory importance to analyze the robustness of thisclinical favorable state of health in the face of perturbations. To this end, the paper presents anoptimization technique to determine whether an assigned rectangular region, which surrounds anasymptotically stable equilibrium point of a quadratic systems, is included into the domain of attractionof the equilibrium itself. The biological relevance of the application of this technique to the analysis oftumor growth dynamics is shown on the basis of a recent quadraticmodel of the tumor–immune systemcompetition dynamics. Indeed the application of the proposedmethodology allows to ensure that a givensafety region, determined on the basis of clinical considerations, belongs to the domain of attraction ofthe tumor blocked equilibrium; therefore for the set of perturbed initial conditions which belong to suchregion, the convergence to the healthy steady state is guaranteed. The proposed methodology can alsoprovide an optimal strategy for cancer treatment.</pre>      </body>    </notes>"
    },
    "BIOMD0000000912": {
        "name": "Caravagna2010 - Tumour suppression by immune system",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>Tumour suppression by immune system through stochastic oscillationsGiulioCaravagnaa Albertod’Onofriob PaoloMilazzoaRobertoBarbutiahttps://doi.org/10.1016/j.jtbi.2010.05.013AbstractThe well-known Kirschner–Panetta model for tumour–immune System interplay [Kirschner, D., Panetta, J.C., 1998. Modelling immunotherapy of the tumour–immune interaction. J. Math. Biol. 37 (3), 235–252] reproduces a number of features of this essential interaction, but it excludes the possibility of tumour suppression by the immune system in the absence of therapy. Here we present a hybrid–stochastic version of that model. In this new framework, we show that in reality the model is also able to reproduce the suppression, through stochastic extinction after the first spike of an oscillation.</pre>      </body>    </notes>"
    },
    "BIOMD0000000913": {
        "name": "dePillis2008 - Optimal control of mixed immunotherapy and chemotherapy of tumors",
        "description": "&amp;lt;notes xmlns=&amp;quot;http://www.sbml.org/sbml/level2/version4&amp;quot;&amp;gt;      &amp;lt;body xmlns=&amp;quot;http://www.w3.org/1999/xhtml&amp;quot;&amp;gt;        &amp;lt;pre&amp;gt;Optimal control of mixed immunotherapy and chemotherapy of tumorsLisette Depillis, K. R. Fister , W. Gu, Tiffany Head, Kenny Maples, Todd Neal, Anand Murugan and Kenji KozaiAbstractWe investigate a mathematical population model of tumor-immune interactions. Thepopulations involved are tumor cells, specific and non-specific immune cells, and con-centrations of therapeutic treatments. We establish the existence of an optimal con-trol for this model and provide necessary conditions for the optimal control triple forsimultaneous application of chemotherapy, tumor infiltrating lymphocyte (TIL) ther-apy, and interleukin-2 (IL-2) treatment. We discuss numerical results for the combina-tion of the chemo-immunotherapy regimens. We find that the qualitative nature of ourresults indicates that chemotherapy is the dominant intervention with TIL interactingin a complementary fashion with the chemotherapy. However, within the optimal con-trol context, the interleukin-2 treatment does not become activated for the estimatedparameter ranges."
    },
    "BIOMD0000000926": {
        "name": "Rhodes2019 - Immune-Mediated theory of Metastasis",
        "description": "&lt;notes xmlns=&quot;http://www.sbml.org/sbml/level2/version4&quot;&gt;      &lt;body xmlns=&quot;http://www.w3.org/1999/xhtml&quot;&gt;     &lt;p&gt;Abstract:Accumulating experimental and clinical evidence suggest that the immune response to cancer is not exclusively anti-tumor. Indeed, the pro-tumor roles of the immune system - as suppliers of growth and pro-angiogenic factors or defenses against cytotoxic immune attacks, for example - have been long appreciated, but relatively few theoretical works have considered their effects. Inspired by the recently proposed &quot;immune-mediated&quot; theory of metastasis, we develop a mathematical model for tumor-immune interactions at two anatomically distant sites, which includes both anti- and pro-tumor immune effects, and the experimentally observed tumor-induced phenotypic plasticity of immune cells (tumor &quot;education&quot; of the immune cells). Upon confrontation of our model to experimental data, we use it to evaluate the implications of the immune-mediated theory of metastasis. We find that tumor education of immune cells may explain the relatively poor performance of immunotherapies, and that many metastatic phenomena, including metastatic blow-up, dormancy, and metastasis to sites of injury, can be explained by the immune-mediated theory of metastasis. Our results suggest that further work is warranted to fully elucidate the pro-tumor effects of the immune system in metastatic cancer.&lt;/p&gt;  &lt;/body&gt;    &lt;/notes&gt;"
    },
    "BIOMD0000001011": {
        "name": "Leon-Triana2020 - CAR T-cell therapy in B-cell acute lymphoblastic leukaemia",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>This model is based on the publication:\"CAR T cell therapy in B-cell acute lymphoblastic leukaemia: Insights from mathematical models\".Odelaisy León-Triana, Soukaina Sabir, Gabriel F. Calvo, Juan Belmonte-Beitia, Salvador Chulián, Álvaro Martínez-Rubio, María Rosa, Antonio Pérez-Martínez, Manuel Ramirez-Orellana, Víctor M. Pérez-Garcíadoi: 10.1016/j.cnsns.2020.105570 Comment:This model is based on equations (4a)-(4c).Abstract: Immunotherapies use components of the patient immune system to selectively target can- cer cells. The use of chimeric antigenic receptor (CAR) T cells to treat B-cell malignancies –leukaemias and lymphomas–is one of the most successful examples, with many patients experiencing long-lasting full responses to this therapy. This treatment works by extract- ing the patient’s T cells and transducing them with the CAR, enabling them to recognize and target cells carrying the antigen CD19 + , which is expressed in these haematological cancers. Here we put forward a mathematical model describing the time response of leukaemias to the injection of CAR T cells. The model accounts for mature and progenitor B-cells, leukaemic cells, CAR T cells and side effects by including the main biological processes involved. The model explains the early post-injection dynamics of the different compart- ments and the fact that the number of CAR T cells injected does not critically affect the treatment outcome. An explicit formula is found that gives the maximum CAR T cell ex- pansion in vivo and the severity of side effects. Our mathematical model captures other known features of the response to this immunotherapy. It also predicts that CD19 + cancer relapses could be the result of competition between leukaemic and CAR T cells, analogous to predator-prey dynamics. We discuss this in the light of the available evidence and the possibility of controlling relapses by early re-challenging of the leukaemia cells with stored CAR T cells.</pre>      </body>    </notes>"
    },
    "BIOMD0000001012": {
        "name": "Leon-Triana2020 - CAR T-cell therapy in B-cell acute lymphoblastic leukaemia with contribution from immature B cells",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>This model is based on the publication:\"CAR T cell therapy in B-cell acute lymphoblastic leukaemia: Insights from mathematical models\".Odelaisy León-Triana, Soukaina Sabir, Gabriel F. Calvo, Juan Belmonte-Beitia, Salvador Chulián, Álvaro Martínez-Rubio, María Rosa, Antonio Pérez-Martínez, Manuel Ramirez-Orellana, Víctor M. Pérez-Garcíadoi: 10.1016/j.cnsns.2020.105570 Comment:This model is based on equations (3a)-(3c) from the paper.Abstract: Immunotherapies use components of the patient immune system to selectively target can- cer cells. The use of chimeric antigenic receptor (CAR) T cells to treat B-cell malignancies –leukaemias and lymphomas–is one of the most successful examples, with many patients experiencing long-lasting full responses to this therapy. This treatment works by extract- ing the patient’s T cells and transducing them with the CAR, enabling them to recognize and target cells carrying the antigen CD19 + , which is expressed in these haematological cancers. Here we put forward a mathematical model describing the time response of leukaemias to the injection of CAR T cells. The model accounts for mature and progenitor B-cells, leukaemic cells, CAR T cells and side effects by including the main biological processes involved. The model explains the early post-injection dynamics of the different compart- ments and the fact that the number of CAR T cells injected does not critically affect the treatment outcome. An explicit formula is found that gives the maximum CAR T cell ex- pansion in vivo and the severity of side effects. Our mathematical model captures other known features of the response to this immunotherapy. It also predicts that CD19 + cancer relapses could be the result of competition between leukaemic and CAR T cells, analogous to predator-prey dynamics. We discuss this in the light of the available evidence and the possibility of controlling relapses by early re-challenging of the leukaemia cells with stored CAR T cells.</pre>      </body>    </notes>"
    },
    "BIOMD0000001032": {
        "name": "Al-Tuwairqi2020 - Dynamics of cancer radiovirotherapy - Phase II treatment",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>This ordinary differential equation model of cancer radiovirotherapy dynamics is described in the publication:Salma M. Al-Tuwairqi, Najwa O. Al-Johani, Eman A. Simbawa,\"Modeling dynamics of cancer radiovirotherapy\",Journal of Theoretical Biology, Volume 506, 2020, 110405, ISSN 0022-5193,DOI: 10.1016/j.jtbi.2020.110405.Comment:This model is represented by the equations in system (14) of the publication manuscript and describes the cancer-virus interactions for the Phase II radiovirotherapy treatment.Abstract:Advances in genetic engineering have paved the way for a new therapy for cancer, which is called virotherapy. This treatment uses genetically engineered viruses which selectively infect, replicate in, and destroy cancer cells without damaging normal cells. Furthermore, current research and clinical trials have indicated that these viruses can be delivered as single agents or in combination with other therapies. In this paper, we propose systems of ordinary differential equations for modeling the dynamics of aggressive tumor growth under radiovirotherapy treatment. We divide the treatment period into two phases; consequently, we present two mathematical models. First, we formulate the virotherapy model as Phase I of the treatment. Then we extend the model to include radiotherapy in combination with virotherapy as Phase II of the treatment. Comprehensive qualitative analyses of both models are conducted. Furthermore, numerical experiments are performed in order to support the analytical results. An analysis of the parameters is also carried out to investigate their effects on the outcome of the treatment. Overall, the analytical results reveal that radiovirotherapy is more effective than, and a good alternative to, virotherapy, as it is capable of eradicating tumors completely.</pre>      </body>    </notes>"
    },
    "BIOMD0000001043": {
        "name": "Wodarz2001 - Viruses as antitumor weapons",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>This mathematical model of the dynamics between tumor, virus and virus-specific CTL populations is described by the publication:Wodarz D. \"Viruses as antitumor weapons: defining conditions for tumor remission\". Cancer Res. 2001 Apr 15;61(8):3501-7.PMID: 11309314Comment:Reproduction of Fig. 3A was achieved by using the initial conditions infected_tumor_cells = 0.01, uninfected_tumor_cells = 0.0001, virus-specific_CTLs = 0, and with modified parameter sets.For Fig. 3A non-cytotoxic virus, k = 17 and beta= 0.5.For Fig. 3A cytotoxic virus, beta = 0.5.These simulation conditions yield plots similar to Fig. 3A in the manuscript.Abstract:Recent research has indicated that viruses specifically infecting tumor cells could be used as an alternative therapeutic approach in cancer patients. A particular example is the adenovirus ONYX-015, which has entered clinical trials in the context of head and neck cancer. Successful therapy crucially requires an understanding about how viral and host parameters influence tumor load. The interactions between the growing tumor, the replicating virus, and possible immune responses are multifactorial and nonlinear. Hence, a complete understanding of how virus and host characteristics influence the outcome of therapy requires mathematical models. In this study, such mathematical models are presented and analyzed. The study investigates three possible scenarios that could be relevant for therapy: (a) viral cytotoxicity alone kills tumor cells; (b) a virus-specific lytic CTL response contributes to killing of infected tumor cells; (c) the virus elicits immunostimulatory signals within the tumor that promote the development of tumor-specific CTL. The models precisely define conditions required for successful therapy. They identify the parameters that need to be measured and modulated to evaluate and refine the existing therapy regimes.</pre>      </body>    </notes>"
    },
    "BIOMD0000000742": {
        "name": "Garcia2018basic - cancer and immune cell count basic model",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>The paper describes a basic model of immune-tumor cell interactions. Created by COPASI 4.25 (Build 207) This model is described in the article: Cancer-Induced Immunosuppression can enable Effectiveness of Immunotherapy through Bistability Generation: a mathematical and computational Examination Victor Garcia, Sebastian Bonhoeffer and Feng Fu bioRxiv, 2018 Abstract: Cancer immunotherapies rely on how interactions between cancer and immune system cells are constituted. The more essential to the emergence of the dynamical behavior of cancer growth these are, the more effectively they may be used as mechanisms for interventions. Mathematical modeling can help unearth such connections, and help explain how they shape the dynamics of cancer growth. Here, we explored whether there exist simple, consistent properties of cancer-immune system interaction (CISI) models that might be harnessed to devise effective immunotherapy approaches. We did this for a family of three related models of increasing complexity. To this end, we developed a base model of CISI, which captures some essential features of the more complex models built on it. We find that the base model and its derivates can reproduce biologically plausible behavior. This behavior is consistent with situations in which the suppressive effects exerted by cancer cells on immune cells dominate their proliferative effects. Under these circumstances, the model family may display a pattern of bistability, where two distinct, stable states (a cancer-free, and a full-grown cancer state) are possible, consistent with the notion of an immunological barrier. Increasing the effectiveness of immune-caused cancer cell killing may remove the basis for bistability, and abruptly tip the dynamics of the system into cancer-free state. In combination with the administration of immune effector cells, modifications in cancer cell killing may also be harnessed for immunotherapy without resolving the bistability. We use these ideas to test immunotherapeutic interventions in silico in a stochastic version of the base model. This bistability-reliant approach to cancer interventions might offer advantages over those that comprise gradual declines in cancer cell numbers. This model is hosted on BioModels Database and identified by: MODEL1907050005. To cite BioModels Database, please use: BioModels Database: An enhanced, curated and annotated resource for published quantitative kinetic models . To the extent possible under law, all copyright and related or neighbouring rights to this encoded model have been dedicated to the public domain worldwide. Please refer to CC0 Public Domain Dedication for more information.</pre>      </body>    </notes>"
    },
    "BIOMD0000000885": {
        "name": "Sumana2018 - Mathematical modeling of cancer-immune system, considering the role of antibodies.",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>Mathematical modeling of cancer-immune system, considering the role of antibodies.Ghosh S1, Banerjee S2.Author information1    Department of Mathematics, Indian Institute of Technology Roorkee, Roorkee, Uttaranchal, 247667, India.2    Department of Mathematics, Indian Institute of Technology Roorkee, Roorkee, Uttaranchal, 247667, India. sandofma@iitr.ac.in.AbstractA mathematical model for the quantitative analysis of cancer-immune interaction, considering the role of antibodies has been proposed in this paper. The model is based on the clinical evidence, which states that antibodies can directly kill cancerous cells (Ivano et al. in J Clin Investig 119(8):2143-2159, 2009). The existence of transcritical bifurcation, which has been proved using Sotomayor theorem, provides strong biological implications. Through numerical simulations, it has been illustrated that under certain therapy (like monoclonal antibody therapy), which is capable of altering the parameters of the system, cancer-free state can be obtained.KEYWORDS:Antibodies; B cells; Cancer cells; Global stability; Plasma cells; Transcritical bifurcation</pre>      </body>    </notes>"
    },
    "BIOMD0000000812": {
        "name": "Galante2012 - B7-H1 and a Mathematical Model for Cytotoxic T Cell and Tumor Cell Interaction",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>This is a mathematical model that describes the interactions between cytotoxic T cells and tumor cells as influenced by B7-H1 (PD-L1) activity, with a focus on how B7-H1 affects cancer cells apoptosis.</pre>      </body>    </notes>"
    },
    "BIOMD0000000886": {
        "name": "Dubey2008 - Modeling the interaction between avascular cancerous cells and acquired immune response",
        "description": "<notes xmlns=\"http://www.sbml.org/sbml/level2/version4\">      <body xmlns=\"http://www.w3.org/1999/xhtml\">        <pre>MODELING THE INTERACTION BETWEEN AVASCULAR CANCEROUS CELLS AND ACQUIRED IMMUNE RESPONSEB. DUBEY, UMA S. DUBEY and SANDIP BANERJEEAbstractThis paper deals with the interaction between dispersed cancer cells and the major populations of the immune system, namely, the T helper cells, T Cytotoxic cells, B cells, and antibodies produced. The system is described by a set of five ordinary differential equations. Both local and global stability of the system has been investigated. It has been observed that under appropriate conditions this interaction is capable of controlling the growth of these cancer cells. The analytical findings are supported by numerical and computational analytical methods.</pre>      </body>    </notes>"
    }
}